
//TASK 1. Напишите цикл, который с каждой итерацией будет уменьшать переменную, пока она не достигнет нуля и выполнение цикла не прекратится

/*TASK 2. Создайте переменную, которая будет содержать статус пользователя(vip, gold, silver),
если vip - тогда скидка 10%,
если silver - скидка 20%,
если gold - скидка 30%
(скидку вывести на экран)
Использовать switch case )
*/

/*
TASK 3.Выведите в браузере с помощью console.log числа от 1 до 49, вывести только нечётный числа.
Пример:
1
3
5
7
...
49
*/

//TASK 4. Составьте массив дней недели. С помощью цикла for выведите все дни недели, а выходные дни выведите жирным.

//TASK 5. Требуется написать функцию, выводящую в консоль числа от 1 до n, где n — это целое число, которая функция принимает в качестве параметра, с такими условиями


/*TASK 6. В строке находятся буквы "ofdsjgoidfjg". Необходимо проверить, является ли в этой строке первая буква "a", если да - то вывести в консоль "ДА, если нет - то вывести в консоль "Нет"
Усложнение задания: В случае, если первая буква не "а", надо проверить, есть ли в строке такая буква, и если есть - то указать сколько их тут
Необходимые методы для решения задач. split(), join(), indexOf() or include().
*/

/*TASK 7. В строке находятся буквы "ofdsjgoidfjg". Необходимо проверить, является ли в этой строке первая буква "a", если да - то вывести в консоль "ДА, если нет - то вывести в консоль "Нет"
Усложнение задания: В случае, если первая буква не "а", надо проверить, есть ли в строке такая буква, и если есть - то указать сколько их тут
Необходимые методы для решения задач. split(), join(), indexOf() or include().
*/

//  TASK 8
//  Дано число - 123123123123.  Необходимо записать каждую цифру этого числа в отдельный элемент массива. Есть подвох. Разбиение на элементы массива split может осуществить
// только если работает со строкой)))

//  TASK 9 - более сложный вариант, придется поискать дополнительный метод массива для решения задачи
//  Дана дата 01.11.2000. Преобразовать строку так, чтобы на выходе было 2000.11.01


//  TASK 10 Необходимо переписать данное выражение с помощью тернарного оператора ( ? : )
// let test_num = 1;
// let test_res;
//
// test_res = test_num >= 0 ? '1' : '2'

//  TASK 11 Необходимо переписать данное выражение с помощью тернарного оператора ( ? : ) - более сложный вариант
// const price = 55;
// const action =
//     price < 10
//         ? 'Покупаю!'
//         : price < 20
//             ? 'Требуем увеличить размер скидки'
//             : price < 50
//                 ? 'Дороговато!'
//                 : 'Отказываюсь от покупки!';
// console.log(action);

/*
***TASK Задача со звёздочкой.

Таблица приведена на картинке
Описание:

Необходимо в тег <body> поместить таблицу размером 10 на 10 ячеек.
Создать таблицу надо с помощью JS. Создаваться она будет благодаря двум циклам (например: один for делает строки, второй for внутри первого fora создаёт колонки ). В html должен быть пустой тег body, всё делается с помощью JS

Необходимые методы, про которые мы не говорили: append, prepend ( для вставки тегов в body ), classList.toggle()( для изменения класса элемента )

------Усложнение задачи со здёздочкой номер 1 --------
Сделать так, чтобы ячейки на двух диагоналях были чёрного цвета, а все остальные ячейки были белого.

------Усложнение задачи со здёздочкой номер 2 --------
Сделать так, чтобы при клике на ячейку, она меняла цвет не противоположный.



Если будут вопросы - обязательно спрашивай!

*/
